Revit 2026 API

# SolidVolume Property

---

Returns the signed volume of this solid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Volume { get; }
```
```vb
Public ReadOnly Property Volume As Double
	Get
```
```cpp
public:
property double Volume {
	double get ();
}
```
```fsharp
member Volume : float with get
```

#### Return Value

DoubleThe real number equal to the signed volume of this solid.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when this solid is not a valid Geometry object or the volume calculation failed. |

Revit attempts to compute the volume analytically, if possible. If an analytical solution is not possible, it uses tessellated faces to calculate a reasonable approximation for the volume. The calculated volume may be slightly underestimated or overestimated if curved surfaces are present.

#### Reference

Solid Class

Autodesk.Revit.DB Namespace